Tekla Open API Reference for Tekla Structures 2025
BoltGroup.RemoveOtherPartToBolt Method
 Removes the given part from the list of the other bolted parts.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveOtherPartToBolt(
	Part M
)
Public Function RemoveOtherPartToBolt (
	M As Part
) As Boolean
Parameters
M
Type: Tekla.Structures.Model.Part
The part to remove.
Return Value
Type: Boolean
True on success.
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace